In [1]:
import pandas as pd
from ast import literal_eval

In [49]:
# Read the data into a Pandas DataFrame
keywords_df = pd.read_csv("Resources/keywords.csv")

keywords_df

           id                                           keywords
0         862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1        8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2       15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3       31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4       11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...       ...                                                ...
46414  439050             [{'id': 10703, 'name': 'tragic love'}]
46415  111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416   67758                                                 []
46417  227506                                                 []
46418  461257                                                 []

[46419 rows x 2 columns]

In [17]:
keywords_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46419 entries, 0 to 46418
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        46419 non-null  int64
 1   keywords  46419 non-null  object
dtypes: int64(1), object(1)
memory usage: 725.4+ KB

In [50]:
# Rename "id" column to "movie_id" so it won't be confused with other id numbers
keywords_df.rename(columns={"id":"movie_id"}, inplace=True)

keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416     67758                                                 []
46417    227506                                                 []
46418    461257                                                 []

[46419 rows x 2 columns]

In [51]:
# Drop empty rows
# code example from https://sparkbyexamples.com/pandas/pandas-delete-rows-based-on-column-value/

keywords_df.drop(keywords_df[keywords_df["keywords"] == "[]"].index, inplace=True)

In [52]:
keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46409     84419  [{'id': 9748, 'name': 'revenge'}, {'id': 9826,...
46410    390959            [{'id': 224180, 'name': 'blair witch'}]
46411    289923  [{'id': 616, 'name': 'witch'}, {'id': 2035, 'n...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...

[31624 rows x 2 columns]

In [53]:
#solution from https://stackoverflow.com/questions/65621510/how-to-split-a-pandas-column-with-a-list-of-dicts-into-separate-columns-for-each
keywords_df.keywords = keywords_df.keywords.apply(literal_eval)

In [54]:
keywords_df = keywords_df.explode("keywords", ignore_index=True)

In [55]:
keywords_df

        movie_id                               keywords
0            862        {'id': 931, 'name': 'jealousy'}
1            862            {'id': 4290, 'name': 'toy'}
2            862            {'id': 5202, 'name': 'boy'}
3            862     {'id': 6054, 'name': 'friendship'}
4            862        {'id': 9713, 'name': 'friends'}
...          ...                                    ...
158675    289923  {'id': 11800, 'name': 'mockumentary'}
158676    439050   {'id': 10703, 'name': 'tragic love'}
158677    111109         {'id': 2679, 'name': 'artist'}
158678    111109          {'id': 14531, 'name': 'play'}
158679    111109        {'id': 215397, 'name': 'pinoy'}

[158680 rows x 2 columns]